package ru.java.sololearn;

import java.util.Scanner;

/**
 * Логические операторы
 * <p>
 * Вы тур-менеджер, и вам нужна программа, которая определит маленькие страны.
 * Страна считается маленькой, если ее население ниже 10000 и ее площадь меньше 10000 гектаров.
 * Данная программа принимает население и площадь в качестве входных данных.
 * <p>
 * Задача
 * Завершите программу, чтобы выводить "small country", если удовлетворены оба условия. В противном случае не выводите ничего.
 * <p>
 * Пример Входных Данных
 * 9955
 * 7522
 * <p>
 * Пример Выходных Данных
 * small country
 * <p>
 * Используйте && для объединения условий.
 */
public class Lesson132 {

    public static void main(String[] args) {
        Scanner read = new Scanner(System.in);
        int population = read.nextInt();
        int area = read.nextInt();
        //завершите код
    }

}
