package ru.java.sololearn;

import java.util.Scanner;

/**
 * Циклы while
 * <p>
 * Для урока математики вам необходима программа для расчета факториала числа.
 * Вам дана программа, которая принимает число в качестве входных данных.
 * <p>
 * Задача
 * Завершите программу, чтобы рассчитать факториал заданного числа и вывести его.
 * <p>
 * Пример Входных Данных
 * 6
 * <p>
 * Пример Выходных Данных
 * 720
 * <p>
 * Объяснение
 * Факториал числа равен произведению всех чисел, которые меньше или равны заданному числу.
 * Факториал 6 будет равен  6*5*4*3*2*1 = 720.
 * <p>
 * Подсказка
 * Используйте цикл while для расчета факториала числа.
 * <p>
 * Используйте уже определенные переменные fact для своих расчетов.
 */
public class Lesson152 {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int number = scanner.nextInt();
        int fact = 1;
        //ваш код
    }

}
